node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 4128469
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "S(H>\007\361\271=\235\3665\276\346\306%\276\227\241\362=&\341\345<w\372O=}U\014>\364\244\004=a\233\315\275\366\230\274=\010f\025\274\320k\002>0\325A>;-\315\274\026\225n\275\347sJ:%\354D\276\236-\364<\r\343k\275\035,g>\314-f>\002\206\204=\351\353\017\276_\004J>\326T\361=%m\243\274U\216\020\2740\373*>{w\r\276\356\322\275=\364\3179=\233\270\256>&\231\345;\373\331.=\236A\356\275c\340\366\275t\203\231<\361\225$\276Td$\276\274@\003\276\n\030\205=\2530\n=cJ\307\275Y\372\361\275s0\314\275\343\n\274<\340\031v=Zs\302=\005\2624\274\250\034&\276\333\323\343=\\3\016>bN\334<h\306\360=\327)\202>\367AX\2761\275q>x\3042<2c3\275\0024\376< [\005\276\363\246\262=\317)\034\275\226}\034\275\021A.\275tb\r\276\310_#>b4\322;r\224\305\275l\016\035>P\233I>1\322\004>\024O\202\274~~Q>BQA\276p\346=\276Y\352F\276\376\005J\276\006\210\365\275\275\255\036\276\365\243_=.\347W\276{m*=8a\230\2755h9=\370\343\332=\343\320\232>\217*n>\206J\205\275\230\0021\274\024\367Z\274;ad=h\344\325=!p\037\275\202\354\314<A\201\323\274\005T\330\275\032-\007>\330E==Gr\n>R#)>*\355\202=\240\274 >\230\034\327;\006M&>\026\241-\276|\221w\275p\024\224<eN\030>p\311\036\276\363\035\244=q3\033>\231\371\354\274\031K >:3g<\215$\r>\312h\203\276\316}\341=]\355\342\275\201\334\214\275\362\306\217\276\262\351\315=\200\243X\275\324\263\320<7\315\272=/ZP\275\257Pc=*\022\366\275\r\374\322=\256\250&\276\300\333\201\276N0I=\235\265\247\275\r\rf<}%\235<\231\217d\273\332-j>\203\277g\276uU\032>f\253\021\274\272a\231=1+\341\275c\024<\276\274\372\034\275\202\2277<\035Q\364\275\330\3169=t\237\312=\265\364e\274\212\003\201\276NZ\267=>\226V>X\227O\274\253\205 \275h\303\333\2743\206\357<$\261\013=+n\013\276\007\222\202=\177\203#=2\202B=a\"\210\276\375=\010\2759\303\212=\020\024\"=\031\2108>y\303\224\275\\6\271\275\016\013\003>\213\335\340\275\305B6>\356v=>\326\316g\276c=$\276\341\375\271\275s\204h=|1a>)\323g>`!\222=-\317\303\275P\214\021<z\265B>\004h\004>\274\000\233=-V\224=2\232\002\276\275\354a=\0144\026>\317\002\217<\301X#=_un>\362\266\364\275A\317~\275\033<\231=E\227\177>V\315\242<1\341\261=\t\221\005\276\330M\212\276\3478\263\275\250f\004>c8B\276\272\326\364=s\313r=\310\231#\276Y\200\'>\023rc\276\007\355L=\300\2018\276l%\326\275\322\242\333=X3k>)HM\275s\342\226\275h/\253<\231\356\007>\363\363\n=\263\026\276\275IC\211=4\330\005\276\232m\244\275;A%>\367\204\371<j\357\002\275\325\026P\276\220\3174=ZQS\276\033\307z=\027\316\"=\363^l=\367}[\276X\n\333<\321\214$>\020\211\317\275\361\022X=\204\222.\276a\217\217;\030}U>\241\321\335=\210\345\320;(a\225=\343\304\005=z\0161\276\217\236=\276d\320/\276\337\333\367\275\227\342}\275c\210_:y\243V\275\204[\320=\303>\244=`.%=\224\313B\272\220D(\273\343\217\314=\200\201+\275\370\033\354;\324\253|\275}t0\276\\w\264\275\361\212\255=eO\222\276\366!\223=h\245w\275B\377/>\000\352\300\275\326//\276\251\277\372\275\310\212\020\274.C1>\200mE>\373s\034<K\250$>\0343.\276\036\3632\276H\227\275\275M\3466\275\2266\251\275\212a\032\274^4\313\274\221\341\032=\355\3230\276\375\265\364;!\313\334\275\357\021\310=C\3512>N\tx>X\010\033<\232N.>C\214e>\362HR\275\205\260*>.w\235\275\326W\347\275\243\220j\276\304\236\204\275\2451\247=\265\004\253\276\313g\330\275\345Wm\276<\237-=9\257\305<N\257=\275\240K\242\275\342\335i\276\225g\222;\345N\257\275d\034l\276:A%\276\031\302\203=\016\350\336=d:\004>\231\236Z=\371P\346\275\240\017\223\275\345\342\010>\353\201N>XU\315<N\343\324=Q\022\000\276}UE\276\334(\354=\335Q\331=\224\343\372\274\377\330\023\276\220\225L=3\272\232=\3568\216\275\255\335\304=\341Eq>\327B\211=AVN>\347Xq=\252\356\327=\372\246r\276RB#>\364\335\215\274\320\272+\272\000\341H>\204\245L\276\035\211\206\275\033\000\321\275\330\263C>\256\201\271\275\352\312<=\265\346>>\013\000 \276 EK>\224\312\340\273\262\267B\276\225\034J=P\223\263=\212~\270=1\215\214=\265M]>\210R\306=\374%\207<\\\021\203<\315\342\323<\017\360\246=\200\204\024\276\373FA\276\335\277\204\275f)\315\275\311\261\276=\274\367\221>$\243)>\224i\r\276\217wD\276\r\266\231\276\321dV\275Kq\001>\007\306&\275\243O\321<\034Y\360\274\\eE\275\017\367\264;\021#\355\275\231Y6\276^\004\023=e\014\243\274\034\321\214\275\267\251\023>\310a*=\336\327p=\024\306\212>\255U2=y\\\261\275D$\255=A\347\376=\275\3535>\322\004\372=\344\323\324\275W\332\023> \027\254=g3\336\273\032\022\265=\322\343\270<\332\236(>\367\233\t>\332h\226\276X\222\341\2756\216\365=\274\003\316\275\346\233?=3\033=\276\357\274\236<,\374o\276(d\005=e\371=>\202\327\227\275\354\027\321\274\007k&\274oX\265=zz\267<\222\366\363\275\247?1=\037\341\371\274\004\2715>\030~\001>Ok,\275k\325\310\275\272\321\263\275\361@0>\350\353\007\275\234\260\214=\203\231_\275+\247w\275v\027\245=P\252\252\274!\276\023>[R\236\275H\304\302\275\335v\001=\260}A\276\243:\225\275:\275W\275\247{p\274Dc~\273\203o?\276\001\316\023\276\262;\214=\246\022\232=\322\226*\276\232\360S\276}\343\275;\033K\200>\246/Z=A\252g\275u\264\262\275~0\205\276\3744\212>\270p\252<\237Id=\211\214\031=%\261c=\255\346`\276\261\2016\276\003\343\233=-v\353<{\007t\276\217\025v\274~\356r\276\233\352\316=\314@\225\276\337\032\023>3\330\262=\360\230\021\275%T\\=\345\207\356=\203\222m=\027v\201=]\214\321=)\215d\27532+\276~\245\342\275\271H\200\273\222vn\276\274\270\004\276\333+\037>\346\252\311\275\222e\304=\203i\210\274\373\251\345\275?\305B=*\3565\275\2077\303\2751\235U\276\".\002\276\242\364\301\274\337\237G>\346\367/\276\3610\372=\347a\304=\325\264\006>\352e}>jq1\2767\0365=R\240\322=\350H\210\276\000\246\000>a\322\323=\322\024\324\273\021I6\275\373\261\206>g\037\003>\332\'\250\275\375\277\234\275\3246.\276\261c\023\276|\023M\276\274\200\032=^\371\375\275\203o\210\275\222\227I\275K\232\272=\007\'1>\255\001#\276\"n\206\275\372\363\322=\367 \021\275d\322$\275\036v\215>\262\246\344<\226\347\272<\317X\374=\004S\354=\303\335G\276\240\2163\272O\263q\276\276\341\361=:\245G\276a[b=\362C\024=;\371\215\274K\213\004\274e\036h<?\213\262\275\342\232\000=\325\341\204=\233Q&\276\255\357?=\032\271\216\275\230\2150\276\251O\177\276\312\'\343=\364G\240=\374\240\225=L\025\311\275\202y\366\275I\226A\276\033\310?\276H\305\023>\351y{=u\037W\274\366n\205;\273 \305\275\274$\035\275\324\326s\276XU\n\276X\323\020>\313|U>\223\036\345\275\233\250L\276c\223\327\274\233\257\246\275\331\255\251=\3617?<\031\2343=\243\241\014\275\324\031\260<\370yZ<n\211~<];\002>\251-\200\276\031\246\253=\177\036 \276\300\350\201=\030\203I\276\225\327\314\275z\006\333<\346N\354=\276;\235=\314\271E;&\273a\275Q\336\227\275aPg\276\204\247\250\274{;\235\276,\r,\275\267\323x\276j\305\267=O\337X\276\315\000R\276\202^\274\275\002\021\000\275\372\364@\274\356\220|\275@\320\310<\355?\033\275\246;\315\274\022\322$<\320\206$\276\211\235C\275\324U]\275\313\351\202\275\261\226\206\274\201\214\304=i+\320\275\001\024\214\276\202IA>h\272#>\354t\254\275D\3231\276\250,\033\275S\257k\276\r\001\037\276\032W\320\275\305GX>1\230\225\275&\241\342\275\331\013s>{w\321\275(\300t\275[Y\032\273U\267#\276n1\361\275L\034\'<\221\222\221\276\364\323p=\254\261\254=\2046\007=n_\341\275/\250\t\275\210\205\">\214\362\t\274\rU\242>\213\240/>\235\006\312\274S,\243\276\230\275\007=\252\010\226=p\362\'=\220\250,=\302Z\205\275\325\032t=]\305\316\274\277\276V\276\361\264\200=/\374\362=\235\350h\275`\204\006>\231\325\373\274\202d#\275l\261\266\272\206$\355;\253<\016\276\373\211\361<\001\263\027\276\035A^\276\305u\362=c4\351;[\353\313=\261\376\022>o\324\264\275de\341\275\305Z\374=\210\031?<\024\265\260=7\374x\275\033\243\224\275<\'\227\274\031_\037\275p\354\032>\310N\007>\315\321\001\276#\274e\276y\326:>\330T\234\275\337\374`\276jl\035\276\327W/\274\034\010\330=\317uG>qo\227\274\344p\206=9O\241=\271\232\322\275\301m\036>\004\310\034\276\274\246z\275 \355\354=\312\336\035\276Oi\271=Q\246\372\275+\035\r<\221\224\276>Xo\001=M{k\276\312\312\232<<\364\201\276\275\206\031\275\203f\340\275\312\033\333\274\211=@>\372\377c\2755\271\343=\226p>>nw5=\210\000i\275a\330\320<\347\2375>Z\224d\276\004\341I\275\314m\302;*#\2149\344\n\201<T.+\274\001\241\272\275\316\305\303\2754\034$\276\213\305\216\276\310\371\'>%\335\202\276\356\207\347\275\207\244i\276\225\262x=\204+\330\275\233\241\242\275\311\nC:\207\357{\275\244\223g\276\376N\252<\240E\036\275\026\354\355=\300\253J\276EM\211=\037tM\275O\027\202\273\277.#\275\340b\304\275\321\214y\276\351\036C;\000\347\201=\206^Q\275\036\000\223=\361\'4=\366\352\233=\3502\001=\317\242\247\274nV\245<\226M\375\275b&\242\275C\311w>1\024t=\3724\023;\034\333\007\274:[\025\274\204<*\274\373\032[\276\226P<>\300\342V>L\360>\273zUx=\324\265F\276\271\301\263=\027\216\020>\315\221H\275\t\340\206\275\024\000\r=\017\244\276>wD\203\275\304\373\250\275K*2=\271Q\002>%\260*\276[\260e:4\213\363\275\304\215\254=\263\241z\276\330\013\217=\240[\255\272\227%\260\275)P\241\276*\261K=\322\037,<!\375\330=^\252\203>\35733>\033s#\274go|>\013Q\230=\204,\304<\316/\362\275%\232:\276|\214\030>\230\363\353=a\335\277<$\334\251\275\001\306\221\274\212h->HE\347=\'/\000;\320\021|\276\235\357\335<\231\334n>\372\227\323=\370\004\010=\375\220\036>r\303\014\276\355\316\376=\202\263\207\275h\225\006\276\177?\260<\020_\026>tP\231=\347%M\274r\377f=\204\006_\276\002\313\216\275\030>\334\274\212\2328\276\351d\322\274k\374z\275\'\344J\276d\273\371\275,\341]>\226\354O=\2411\240=\371\245\275\275\241\315\270=\014\220\017\275\316\307\021=\"\033y\275\206\022\370<D\024\202=|IM>g\267.=\230\246\327\275\027\242\022>q\200\233\274\263\3405\276\313J(>^\334\314=%\217F\276\370\230\312=B\027\232\275y\006I\275?N\245=\266{\324\274\n\264!>\325\026\034\275\365\021\247\276\252\200k\275>8_\276`\305\037>\022\334\034>c\313\203\275\010\272\267<\222\310\201=\2014\254\2757\270\n\276\252[\243\275\023\337\031=\016\333o>7\352A=\215\'\334<<5\257=?\224\t=\2155\240\276\201\240$>\031\233C\276}\334\323<\333\333\313=\223\275 \276~@\363\275\233U\\=\216\306H\275^R~\276.\027\220\275\014\007\372\275\243\324\223=o\322\342=\370\274\344\275\267\t\276=i[.>\004\335N\276\345d)\275\007\367\242;\344\266\221<\013\t\335\275\255\t\240=P\311\360=p\333\367=6\326\373;\315|\000\276i)\033\275P\247o<\032\025G\276\000\227#>\036\344\251\275H\343e\275@\225S\276\234\032\352=\240\252\303\274\366\256\224\275\270\302\003\276\220\351N\2740I\343\274\341X\246>g\273#=a\371\255\275\023\205\036;Z|\362\275\340Q\026>\225\362\r\276\240\205m>\r\253I=\032\374W>c\260(\276\177\363\204\275\034\017\020<^{X\2762\3629\276\'t]<\033@\377<\322\323$=w?\000\276Rr\334\274%\313\204=\327\253&>i\211c=\324Nq=\327\375\001>w\321\362\274\002N\361\275\007t\360=\302]\320=\034q>\276\252\002\211>\327\336\017\276:\367\000>\332\213\253=\323\035\336\274H\221i\276\320B}\276HS|\274{\265\322=\327.p>\246\210\240<\016\343\246\275M\r\254\274W\263\013\276{\344\216\274\2743\212=/0\'\275\"\244\307<-9\205=\202(.>D\376a=\3205\306=\233K\317=\273\246t\275dQ\370=\027\353\026=Z\301\020>\\2\355\275\226\267\350\275F+\323\274\271\253\373\275\021r\247>\240\300\316=\005+\223>\342))<\023\200\'>>\334@\276\022\203\313=\t\255\000\276\315jm=h\333\335=\273-\007>\310\001\363\275\343\327+\276\036\000h\275\252\004\304\274\212y\363=%\277\363=\n\360M\276\213\303\266>t/v\276\361\241\206\275\";\275;\2304%\275H\301\337\275$\247$\276\342\324\037\276y/\243=\352j\001>\311v\343=\032\024\332\275.\n\325=\263\273;\274\020\243\276\275\010\235\023=\3103\275\275\340\264\221=4\264\217=\343#\010=\374-w\276;\217\255<%q\266:\271:Z=4\004i\275\356]\004>\247{\213\275s\326\241\2753i\"\276\004q\024=\322\240/=\250\235A=\247i\002>\267\275\223\273\332f\213=\033\346\014=\362P\237\275\r|\333;\252U\277<xk\023<\236\021m9;\301H\275\340\033\224:\357\312\252=U\322\027\276`\255\232>J\363\330\275-\361\313\275\007\370\002\276u\375%<\270\306C>\322\363\343\274\\\t\347=~\215\330=lw\257\2752\001\311<m\\n\275\026\226Q\271\3374\257\272\r3\305\275m*\001=\372\353\004\276\322\021l>=\315\026>t2==(\245\266=yc8>\273\000\363=C\345#\276\'\337\023>WZW;\32797>b&\260=\010\234#>\345\266\233>R)T\275X5\251<\306\264\256>\332u\225>\225fM>XK\034\276Q\304^>;\026[\275g\245\231\275K\242\037;\203\035\302\275<\265\247=3\364\017=\231\204\t>\020\010j=\305\341\332=\225\327\200<\245J\231;\017\235!\276F\265L\276U\375\021>\026\361]=@\177\214\276P&\372\275\243\374#>\224q\262\275\271Y\213\275>/\t>\n\214<>\2039\231\275N:1=\010\020Q\275\357\n\327\275R\326\000>\216\367}<\\@\231<+\247\306=h\243\250\275l\272\207\275\020\217\357=\006}\372=\377E\241=8\313\324<\005\024\256\275R\037\241=k^\021>)\234\022=\226\223\231\276\005\236\253<s\3262\276n}V>\016\257\272\275\2167\037\275\0275\360\275\361\362\300\274h|\224=\236\t\265\275>\276\213=\372\t\236=\nd\226>s\361\013=\323\220P=\300R\002\276\354\350Z\274\002\223S\273eK:\275\252\030\n\276\322\025\013\276\005\007\027\2760\201\271\275\341\260>\276I\005\234\276\020!\231\274\347^\222>X\274d=\243\240W\275\315\2506\276\222\360\210\275t|\n>c\345\004\2765\n\217\275\340\n\217\275\373\035\017;N\006\014>\001\014\305\2759_+=\300\r_=\236\354\367=\3555\205\275\210\032\354<\021,\216=\235\261\r\275\254\265e>\025\355\021\276\3447\353\274\270\266\002>;\247#=P?T=\013\273\247=\016 c=\177o\265>[S\021\276Y\r\263\274\325\2110=A\251\270=\241u\000>\227\317\262=\351\234\372<2\324\025\274\014\324\204>|\371:>G)}\276tR\237\275\341I\334=R\313\261=t\276\022\276\260V\206=\377\214\227=>V\356\272\353\235w\267S\030z> \311D\276\243uU;\001F\255\272*9O\276%\002\317=\177\372\215>\255D;<\034E\240\275(\026\301=\227\310\366=\313\t\177\2763;\t\2742\315\251=\345\013E>\306i\261<"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/Shape_1"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_11/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/strided_slice_11/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_11/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_11"
  op: "StridedSlice"
  input: "net/Shape_1"
  input: "net/strided_slice_11/stack"
  input: "net/strided_slice_11/stack_1"
  input: "net/strided_slice_11/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/Shape_2"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_12/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_12/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_12/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_12"
  op: "StridedSlice"
  input: "net/Shape_2"
  input: "net/strided_slice_12/stack"
  input: "net/strided_slice_12/stack_1"
  input: "net/strided_slice_12/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones/mul"
  op: "Mul"
  input: "net/strided_slice_12"
  input: "net/strided_slice_11"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones/Less/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1000
      }
    }
  }
}
node {
  name: "net/ones/Less"
  op: "Less"
  input: "net/ones/mul"
  input: "net/ones/Less/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones/packed"
  op: "Pack"
  input: "net/strided_slice_12"
  input: "net/strided_slice_11"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "net/ones/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones"
  op: "Fill"
  input: "net/ones/packed"
  input: "net/ones/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
