node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 5550412
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "e\273u>\325\321\337\272^4\302<\227\316\371\275\363V\211\275n\213\200<47\301\274\200\020\r<PKD\276\345=\013\276\\\321\201\276\243\213\324\2756{\220\275\336E\016\2769\213\362=^\353\337<\005\r\005=\373\374\234=\212\036\261=\212\240\257\274J\266\002\276\215\321\r\275\312z\310\275\022aB>\t\204\213=\277\253\310<r\232\365=\214\357\375\275\"O\367=\323V\254=\213(S\275\260<H\275#\001l=\242\212j=\360W\220>r\264k\275\'x(>\022\261s\275A-\374\275\035\037\000\276-C\224<.x\212\276\261\204\235<\343\313{\275\346\273%>\305\304\317\273\0104\334>2I\221\275\263\300\266=f2.\275\332U\026\276\205\017x\274\036\235\336\275\272- >\335\371\013>\315\034\330<\326\266\322=\212\252\355=\343yi>3_\213\275\361\300\321\273\312\336\365=U@\240\276\223\370\243\275\317\3206\276\321\376]>\370\010\275=\365D\000>\317\246\322<~\332\341\274\273\216\266=+\364\302\276\301fG=\237Aj>\216#E>\211\232x\274\235\206c\276^P\234\275\374\321\305=\365\317\317\274\345 \007>tHR\275J\246\245=9\\q\275l\245\366\274J\224|=\230\257j\276Ml\024>\375<O>V{\321\275}\332\300=@\033\270\274MS\352\274,\356\204=\264\010\022\274\220VH>\263[\002=\331\233(\276\271\350\240<\024\005\">v\212/=\032i\264=\240\001\274=\"Q\374\275~\010\231\275\303\313\017>\373\241\010>\215\272\353\275\366\354\243\275~\177\327\272\017\033E=\356\324\266\275\005v\014\276c\367\334\275\243k\232\274\237\364\025>*H+=\243*\356\274\355mG>\215\367\036\275o\377\031\276\235\025<>\244\306\343\275\325\213\341\274\330\235C\276z\004C>\322\305L\275=\302\001>\221L\022\276\220\017\032>:\225\010\276\214\005\023\276\374,)=\357V6=\337\333\303\2758)\030>\216\t\212=\357\243\273=\220?\014\276\345\177e<\367}F\275<g><\205~#>=3s>\n\031I\274\020$<\276C|\203=\266\033\021\275\231\010\246=\237+\207>\244\362e\275\332\375\364:\032\267\336;\212(\261=\210\226\016>\346R\360=\367\201\024>\325\304:>` \216\274\347\217\251\274\037q\367=\307\353\353=*\273\306=\271$\354<\201\024\337\274/V\315\275\261\3623\276\321\357g>\250\004\247\275\316U\215<\341Z\347\274\317V\207\275\030,\362=\021\250\207=\302]l\2765\n^\274\377\027\022\276\226\001\247>H\262\350\275\320\034F\276\301o\221\276u\335\203=h\245\202<:\306\204</\325U\275\306\203\001>?\\\034>\007\305+>\257%\005\276\237\371\003\275\303\327\207=M\013|;S\256^>\0217I\275\2575\232\275`\326\217\276\375\272\006\275\263[\030>0\330\335;\363\315\234=\016H\336=g\347\273\275wK\215>Y:<<\301\261\252=\014\352\323=\266:\301\274\3050\211\276J\247\t\276\321)\026\275\371$\343\275(\032+>D\254\263=\354\361\033\276\346#y=\no\275\275d\324\212\275Z\017\244\275<A\324<\013\320\253\274\354\350#=W\352\227\275\274\214\343;\270\377R\275\245\235\255\275\035pM>\036\302\200\275Rc\251=\274S\021>\002=\270>l\227\335\2758\230 <\276Z\375\275\261\242\021>\001\367b>\007\253(\276X\303\351=Ja\235<\236\020M=\344J>\274G\264\\\276<\004\375=[~b\275\222\"\006>N\300\\\275]b\241\275\213\213\324\275\002\224y\275\234\235\272\2752\327#\276\364\nH\275\345\030a>\240?\037>U\031%=|\240\031>NNu\274MF\343\275\350\320\311=\315\276;>!\367b=\353l \275\203\310\237=~\231\027>\310\203\365\275`()=\304\263L>?\233#>\031]V>\307\3376>\3136{;r)\377=\254\226k=b\246\217=\376\036\275\275\331\311[\276\346\236J\274\r\252{>\213T\225=\262\250\237\276n\n\267=\245\3135\274\364\203\004\276\r\215\317<[7d>[\031?\275\326\272\265\274\3512\r>\006h\002\276\200\3326>\314\370\317=\017\306\362<Ug8=\365q\337=\205\237\321=\371~d\276x6\313=\252D\207\275\217/\020\275\"_\361\275\006\263\367\275\351f=\275L\021\333=\360\312\254\275$\251(=\270$\017\276\2058\232\276dN\224<\212>)>\222\022\031\275\2362\337\274>i\371<\371\262\010>\007\316H=(\202\000=&\365\320<\257\335[>\332\341\215>\376\301f=\205\243c\276#\267\214<N/\274\274\304]\300=\027\036Q\275\271\311\235\275\374\222r\275&\344a\275=c\244<N\207\220=]\243\375=w\241\263=\006\272\323\275\242\233v>\234\367\355=4/g\274\331mT\274\337U`\274\026\233\031>\034\006\267\274\016\206\243>)\320\370=\222Y\032:\017\017\340\275\375\340\205\276\227\027\237=\033\013\303\275\241Mv>\003\360\035<\257\232g\276\314]\022\276\357:\316\274^\345C=8\321\254\275\266\245Y\276\000\371\010=\262\335\030>\377\324e=\377\226P\276\333\247\221=\350\322\264=\265\276M=\324(\035>\247h\346=\230\024\027\276\307\242\225\274\232\316\200\274do2\275\212j\260=\215Y\202\276\327t\226=D\273\210= X4\275\336\271?\275\024\336\177\275\254\201>>\3078\035\276\362\223\312\274S\332\247=\373\302\030\276\004\220#=\023!\304<:\263X\276s/\366\275\274\321\221>;\327D</\355\213\273\027\\\325=\232\312j>{\212\021\276\2178\302\275\346\037\371\275*\202\340=\177E\343\274\212\333h\274\210\222S=F\317\216=\204\244L=\r\027\256<y\000\202=4\027\031\276\341\204S>\033f\010\275N\2124\276W\277\331\274|?\272\2750\340$\276\364\252\233\275\301c\304=\026\277l=U=\333\2754\010\t>E?\355=\333\301\245\275f\3355\275\240\324\330\274\021\355\226<\026\2372\2768\304\242\276\251RD=\242\334\305<\203>\304>z6\214\276\277Q?<Oe\014\274\267\006%\276t\004\025>~j$>\373\346\211>\306wx<\0268\014\275\363:\335=FO\220\275m\022 \274!\274R=\330\257\227\275\331\341)>TF\206<\331\312R=>Y_\276\270\023\373\275\231H\204=\243\367u\276\324\205V:H\222\365\2749\241\020\275\3446s\274\344\212\224;\266&\246=\372\344\224=\032\350\210=3N\035=U\331\\\276,\\F\2764\033\206\273\332\210\346\275\221\246\026=\226\226\361\275\372+l=1<|\276\035\271\245<&`\n\275\301\336Z\276H\000\322\275u)-\276\371\007\240\274d\024\240\275\315\357`\2757m%\276\014(\306=\277\0267>4\232\326\275\244\000\321\275u\036@\27551\277\275\013A\024=\373X\246\276d\313(>\327\366(<\327\377\301\275\250\'\025>\215\352Q>\220\217(>d\375z\276\362I\n>\272d@=0\255&\276\324\355&>@p\254=@m\252=\311\222\014\276\341y\213=\201A\377=\224\313\270=<i\362=\274\263\236\275A\332|<\3459\360;p\342\310\274\365t\004>\250\363\177\274Px\245=\337\240\374\274\336F]<\223\010l=0j\013>\336\242(\276p8\240>\032g\206=\006`\031=\367\204D>W\2251\276\321\310\030=`\000#\275\373\204\313=\251\344X\276\302d\024>\324  =-7\000\276\305\240\371\275Aa\026=\3277\204\276\001\005 =a-\274\274\222\330\257\273\004\002\020=\003C\323=\177\322\317=:\367\315\272\302\"\003=Z\016-\276\361|\201\275\304-\377=\010#\273\276\301\216\025>\035\315\233\275\014oi\275\352o\016=6\215\200\276\010\206\311\275\253y\032\276\177\'\201<g\326\024\275\013\236\202<5\210z=\204\250}=\236\374l<\2001+\275\347\025\210=F\256\227==\330\016>\303\224\275\276f`\353\275\210\021\222\273\372$\251=\005b\025>D\301\n\274.\226D=C\002\257\275x\375&>\206\331\200>\2732\255=\264\344\306\2743\211\233\275\025\'\305\275\261\275\005=\306D\031\276(\014\254\275\t\3579>\336\346N=v\234T<\372\311-\276\n\257\202\276o\255\310\275%*\002>\231]\003\276p\273\224=\255B\321=a\002\230;\371$g=\357F\205<:\322\316==\212\313=\t\036\256>?[%\276<\234?\276\257bf>\2420\213\275#~\236\275\315>\332=\007=U>\301\307\232\275\203\361\236<\274\256\327=\214C%\276\312^d\275\330J%=\305]\222\275]<\203\276\034Kv=5\217+=\344 \200<\366\365\251=\367.\311\275\036\2163\276X\2479\276\354*\014>\326\230\225<\022\226\213\275a\367L\274b\202\013\276\221\325P\276\304\242\316=\374L\356\274\234\265\242=\022\252\023\276\233I\014\2754\371\346\2757\254d=\\\034\343\275+3\216\273\207\351\215\275Q\244\203>w:\232\276\377\2172\274\3049+>\340\004\022\276<\222,>\303v\362\275rBB>\326\2478\276\361Q\024=fn>\276\305\356M\276\212w+=\362\214\027>.}\336\275\372\371\350=4\207\317=\247-.>nm+=XO\370=z\212\272\274z\355Y\276&\332\217\275\014t8>\004s\005\273\273O\021>}\005\241\274\257\321S>\'\017q:\213`\325\275\356\027\227\274\241\211\n<\273\357\333\275\345f\032>\301|,=\322\213\276=\257\350\300\275\323E\244<Udo\276$a\306<\204R\036>m\247\214\275\010\374\t\276w\210\370=O\357\010>jp\233=x\\6\276\002\237~\275\205F;>\363E\266=s\234\000\276kMJ\276\002\227\232=ag5\276\036\"!=\222\037\363=c\317\342=,\245#>\215\220&>\004=\016>)\033\272<\302\324\030\276\217\2262\275\270Mp=yn\026=\036{\271\274\262\2170>\240\266Z>8:X<-\025\323\275v\300\205\276\361\255g>\342R \276\244\336\366\275\010=W=\247.\253<\037=_\275/=\"\276\021\223\006>\177\002\001>X0\215=\205\202\036\276K\207g>d\001\264=$\226\365\275\007\375\352=\372b\033\276O\241\256\275\373\353g\2752D\315=\2159\\\2767\326\003>8\302^>\322Z*;\303(\326\275!\216\271\275\225aA\275\002\207\260\275i\013\315=KHH<]\314=>\323\254\367<\223\245<=nSO\276v\022F\276\260\024\340<\324\205F;G5\026\275r\337\256\272M\374\010>\2025\340<\245r3\275\032\215\022>2\2620<\301\223\031\275\221\260\237=\024\014\313\275\305\256\250=9\3101\276F\351\360=\232A\014\276X\'(>i\210\004\273\231\261(\276Vr\311\275\234\232\025>\264&,\276\017\216[>\307|\002\276\243\353\035>a\215%=k\341\270\274\"ZY\276\362|\036\276\361\315==\313\360@\276b\252\271=#I\265;t\235\216\276\261\2438>\356\263\225</\356\000>^\314\216<\224|\017\276]\351\013>-s\031>\236\344\000\276\310\233\214<\365\2454<\210\351\026\276\001\344$\276v\005\030>\302In<\215\354\232>0oK>\304\262\340\275@9\340\275\343\210\233\275\035\311\007\275j\236A=k\256\027\2758\340s\274D\t\273=b\331\375\274!\031F\276\247B!\2760\006\000>\326\315\205\276\317l5>/0\016>\262\014\306\274$\200\027\274%\310\323=\276v\320\275\256\366\001>*U\013\276|\241\355=!\323\264\273\254z8\275\224!A\276{\320\r\276\207\247\276\275#\230F>9\317c=\030}\200\275\371\035\016\2761\305E=\364\"L>\342m\346;a\304\333\273\314p\317\275\020l7<q\373\200\275\207\006\205=\003\250\215\276\371T\225>\027\221V;\253\344\240=\212\007\205<\3453\250\276\021\374o\275\007\221\360=\206\300\365;&\235\010\276\306_.\275\301\305\032;\024\'\016>W\333\272=\356\031\231;\014\334\323=\232Pe\276\266\332p\275\271D\030\275\303`\222=\342\250\036>\2465\177=\324\t\364\275\302D8\276Cy\272=2^H\276l\275\341=\r\376\252>\203z\227\276\365\274\340= \362\235=\300Ou\275\315j\003\273\273\324\252\275{\215b\276#4\252\275\361.\230<\270\312Z>\304G\266\275\335\177\244=\372\212\023>\375\261I:g(\023\274W\340k=\3210\334\275C\345\223=\231\370W\273m\240\016>$\356\324<\005\377\267>\206[<=n:\272<<\016\206=51v=1\371%\276g|+\274\331(\314\274um\210\275\307\333\227\275\321\262\'\275\034\032*\276J:,\276SZg\276\245D\203\276\205_\002>\364\331l\275\237\375\204;\250v\233>\375\244T>\366,\311=*a\006\274\246\235\344:~\356#>\222\025\277=\305\003w\273\205~x\275\264\2120\275\332\274\n\275\364\330\257\275\177l\305=)\340\000\273/\301\006\275/\375x\274a\367`\275\'\021;\274\261\325\224=*P\262\275\335\327\034=\021&\004\276r\365\242=x\346\266\272\201\244&=UWJ=}1\336\275Z\272\233;f\311|=2[\017>=5\357\274\276\352\274=\343\253,\276\224\322\221=;@\000=z\275\203\275(\201\017\275i\2069>\013O4<\177L\271\275\030}7\276\227\304r\275\236m:\276\004\242\304=\370\346\001>E\363\242\275\351\252\372<\340c\016>\203\017\275>\354#\n\275\321\022\357\2751\311\t>\036\2678=\243-V=\221\332\347\274/\327\357=Cl\t\276z\346<>4\026\016\275(\327]\275\376}\031>8<\214\275l\357g>\267:r>\214\265\207\276\\\320\225=\366\317[=\202\374\206\276\372\356\t>\017\373g=\333l\305=\3739\005<lv@\274\266\344\001>\346\325\271\276\227\211W\275p\026\254\2758\215\254<\332\273#=\272\'\244<\326\017\274\275\305\327\313\273\017\321\234\275\206c\216\275E\214\310\275\006?\377\275G\251\'\275\350`!=\305\336P\276B\240\244\273+\375\345\275\347\213\021\276\276m\243\274\0379\234\276~-S\276\342%\360\275.\357\204=\226\004\000\276\244\014\236\276\r\251\314\275\230b\035=g\021&\276\201S\033>\235\211M>\020G\001>\324r$=:\253e=\370;]>\3561\213\275\032\240\265\275\327\220\200\274(L\276\273\375\021Z\276o@h\276\311Z\320\275+\343G>\2075t\275H\")=\200\226\021=\014l\317\275\313\206\266=\177`\\<a\371+\276G\247\331<\234\303\207<K\305\004\276\231\003\262;\252\332\205\276\237\003X>\263\322\027=7\367\212\275\007R\200\275\036\236.>\333#H\276\3139\352\274\024\013\336=\304\331\255=\005\024\030=\351\035\204=\263\374\020<d\272#>?\240\321<\235\237Q=>)\017=y~\253\276h\341@=\352%\230=(n)>#{<\276\\\241\266\275\326Q\207\275I\344\211=!\177\\>\264\006@>n\364C\276\022/<;!\243\205=\332\205\221;)\235\265=\031:\205<\2375\374\274U\013\335=\023\204\255\275\223]#>\220!\230=\322q?\275\372\200+\276\'\216l<g+H>\350\010\304\275n\321\303\275%\356\356\275B\344\032\276r\2402=\261\323\253=\006\034\345\274\374\3477\276\3016\004\275A\237\344\275\360\013\2518f\322\227\276\033\350 >\327\224\312\275\'\001\\=\277\341\367\275\261\033T\276\2435\274=\354;\212\276\034#v\276\314\366\245\274\254\263\203<r\226N=\312\312h\275\256\006\316=v\0307>M\276\232\274\314\n\023=\222=B\276 \364p\275\245*\244<\\\345_<U\275x<\223\257\005<\344\260\362=J\210\032>\355j\003>\325&\235\274\360\373\321=?\266\004\276\366\271\223\2761c(>\036]\2679\004\006\033>q\375\037>\233?\237<\302 \276\275d\327F>3\345\302<\362\2313\275\314g\003<\266\267V=\353]\r\276\035\206\231;\320\375\346\275\356\034\032\275\035\351\205\276?\337\242<\374{\223\275\206\352\216=t\225\177\275\265\345\351\272\342\367x>\252\266\001>.o\246=]\373\010\276z\210&\275\351!!>\255\350\274\275\036\206\354\275\236j\247=\001\377\357\274\2100\002\276\361\376\367\275\350J\266\276`\272\300=\217\001\250=x\244X=T\330\300\276\343\\\351=\305\224y\275\270?v=\021\340\216=\212X\304=M\310\'\276\223t\302\275;\010\336\2745\367]\276\226\254^\274=\003\t=\343\242\004>C\316D<\351\226b>\017\375\000\276\201\352B\276\347\221\024>I\337(>\n{\036\276T^\\=-\335\021\276!AI\276h\275\365=2L\204\275\373\247\262\275\357\'\213=\251P%>0\rz\275l\025w;\372\\)\276-\2161\274\351l_=\234\362C\275\220\303\246>\205\324\240\275\246\220B\276\227\263?\275^a\200=\254k\361=\023\243I\275\253A\234\273\343\317\245\275\001\003|<\224\3602=\003\021\336\275\026\256\215<0_\346=\352V\006\276K\254\252\275L\226\371=?W\304=#\300\273\275\334\223\030\275\035\315\t>\010\376\346=\207|\367=D\335\033\275\272\034\214<|\225\003\276\256\311\020\276R\346\354=\307\353V>s\336\202>\244\034I\276\224^\360\2732\254\350\275\r\305d<\202\345\225>\360\347\034>M\256 \276\345\274\257<"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/Shape_1"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_11/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/strided_slice_11/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_11/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_11"
  op: "StridedSlice"
  input: "net/Shape_1"
  input: "net/strided_slice_11/stack"
  input: "net/strided_slice_11/stack_1"
  input: "net/strided_slice_11/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/Shape_2"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_12/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_12/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_12/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_12"
  op: "StridedSlice"
  input: "net/Shape_2"
  input: "net/strided_slice_12/stack"
  input: "net/strided_slice_12/stack_1"
  input: "net/strided_slice_12/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones/mul"
  op: "Mul"
  input: "net/strided_slice_12"
  input: "net/strided_slice_11"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones/Less/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1000
      }
    }
  }
}
node {
  name: "net/ones/Less"
  op: "Less"
  input: "net/ones/mul"
  input: "net/ones/Less/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones/packed"
  op: "Pack"
  input: "net/strided_slice_12"
  input: "net/strided_slice_11"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "net/ones/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones"
  op: "Fill"
  input: "net/ones/packed"
  input: "net/ones/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
