node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 2495298
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "\237=\320\274Q\\\246\275a\316\304\275\017\355\003=\352X\372\274\370\263\021\276\030Ax\275\271\241\252\275\t\266I\275f\255\223=\033P\320\275\3419\016>\315\365\004\276L\221\342=\267\211)\276\336e\204>+\240\216=E\243\250\274k\230\r\275\306O\304<\213u\t>Qg\362\275\352\3140>u\317\271=\371\030\372\2741\0164\275\242\365\344\276\251\250\313\275.\341\242\275\335Q\245\276l#\272\275Q\360\364\2748B}>\224r>\275/&\247\275\312\214?\274z\013A=\2063n>U\336\303\275\267\374\347\273\000\277\264\275_u+\275\245\303\231\275\207\177\014\274\251\r\346=\247\333\337=\274\264,=\374\246_\276&G\257=.\254\362\275\204n\200\276\251v\013\276<\202\271\275\300@\002=\'k\207\275%\235\315=\365\376l\275\035\201Y=\033\312\026>\0261\013=\241\313r\275\357\202\361\275\313\260w>\370\022X>8\033O=r\336\370\275\254Ld>%\242\210=\365\346\316\275\203\013\202\276\005\232\311=\240\213W=4\232\213=%\034\235\274\276\364)=Z[\204=\227\311L>\330\270B>\201n\361=\373\n\003=\326\370\261\275\261\311\222\275\217\272\217\274:\030\353=\025D\355=\255\332\207=\025O\001\276\356;\006>{\210b>\377\341\324=\315\266c>u\336\351=\3632v>\245J\223\274\032\241\344<\311y:\272\251\356\311<\002\206&>3-\206=2\243\225>\031t>=h\301<\274\022\313\217\275h\267\206\275_VL<\226\020\033\275$\222\t=h\213/>\260j =\031k\314\275h\301)\275c\007>>A\316\361=\263!\336\275\332\017\254<\327*\\>W\266G>\"\033\322\275\322\377\014=\010\2452>\231\257\253\275\003CR>\320\026\274=\275T\340=+u\006=\334\013P\2762\257\275\275px\007\275\373\3069>\275_\037=\256\240K>E\304\363\274\202\255\376=\346\273/\276\316\017K\275\337\362#\274n\305\264=\375\237\205\276\020\340\264=v\204\206=\343\220a\275yL\334\274!\207\263<\353\024o=%\034B\276\373g\243<\200\233w\275\376^`\275\232(=\274\275\314\027=\037\257\365\274y\275c\275Q$3\276\332\305&>\357\375(\276s\264+\276G\311\325=\266\326\342<\371\021\205>\264\254n\276HL\177\276\261b >y\227\232\276\3779\266\2759\344\010>\335\237\274\275\237\251\271\274\230\237\224\275\266\265\257\275&\360>\276D\014\304\275{\305\224=\021\014\222=y\374x<OS\002>\265\377\035\275\224\343>>3\207\204\275\242\376\313\275\320\n\017>\252\025k\276\350K8=\'*\317=T\305Q>f_\313\275\232\257\307=\000{\376\275}\037\r\276q\014?\273U\007J\276\247\250p=\027\233v\275\215\037\217\275\227L\035>\374\267\013>QR\262=qi<\274\3620c=\024\351A>PJ\004\274f\337%>\312:\205=>h\034>p\ry\276-h|=\2653C\273\234\276*\276\331\306\342\275\302\341\376\274\310\005?>\345#\277=~\204A>Xy8\274\347\r\000>\211\3319\276\230\210\010>X\333\257;i[\204\276{1\002\276\244g\301\2757p\313\275\272i\354\272\033Fq;{\357\037>\026\3656>\315\253\335\275\236\255b\275\266\226v>|\000\323\275\336\340F=\235g(<\302\230@\276\223B\020\276\226\035\256=\2255\264\275C\003f\275-\211+=\206HY>\221\312\373=\373k\004>\205\327\374\275b\231\250=\222\235\266=\206\033\340\275/\256\214\275N\253P>`\2731\276,\240\365\275\325\215\243=y\315\027\276\025\211=\274\027\243\177>\247\205q=\200\007\000\276-\007\252=0\304\256\275\330 Q\276a\365\265\275\353g8=\322@\232=\216&\307<*\321\031>\3318\226\274\252\263I\276V]\331<\373 9>}\2547\275 #\233\274\311\357\034>BQ\234\276y\000\035=g\247a=\033\212\360<b\203\006\276^\254\211\275\235<\014\276\026;(>\226\346\004\276\212\023@=;\304\221\275\\1\255=\203\226\213\276_QN\276^\007\007\276}\036\006\276z%S>\234\244\275\275\356\226\021>\345\351\222>\017xN=g\217\214\275\340\205\212=\250\353\017>\241\355\303\274\300\014*==H%>\3323s<\333x\202;m\2309;\364\027z\275\225\036\262\276\324\2361=\346\275\325;j\033\205\275e\\\321<\371\307\247<\213\250D\275~\2506\276\253\034\271\275\237`S>6\351\021\276\001D\r>e\223\226>\250\307T\275h9\204=\250|\275=\033\260\217>\252\217\r>\242\244\035>\273\231Q\276\021\014:>P\352\370\275\275\025\013\275M\234\301=[\214\237<\202\307\232\275e\202\324=\004\204y\275\221\236R>o\202\364\274\261I/>R\241Z\274i>\030=\344\023\007\276\n\352\303\275\225\234\234\275\222\212\032\276\234=\203\274\356Z\201=\363\205J\276\267~\345=\216\251\030>c\330\363<&u\202=\200\371\336;\323x\311=Y\372\226\275w\234\010\276J,==A\244\276\274\316\006d>\001\257\236\274?^\311\275UO\347\275\367\002\004\275\177)\274\275\372\375\377=\201C\247\275\301\213\254=\311\362W\276\240\312\302=\225+\365=\377\223\263>\036\371G>B\270\220=\211\r\214\275\206\270b=I\377\014\274NW\314\275A\362\204<\026=\271\267r\223 >9\'\221=\203\036\314=4~\225=\007\255\026=Z\2556\276\354\010\363\275G\352\022<\336\346\007>\313\374\'\274GkZ\274\356Q\270\275Q\343\232<\374\010S\276\\\346w\276\024\331$=\222X\240:\232\330{\275E\210\222=h\003\275\275:P\021>`;M=dr\006\276\366\003\002\276\323<\316=a\020\236\2737\007\275\275\303o\303\276\202v\242\275\006E\241=\246\333\001\276\326\374\177\275 \3554\275z\262l=\347d\226;\211\253S\275\267\032\251\276\231\017_\276:z\223=\246\355\236=\357\366,>\340\t6>\200\031G\276R\314\225;\204N\233=7\211\2429mTh<n<l=-\014\t\276\231j#>>\305\273\2755\020O\275\214\360\r\275\324\211\204\275\270\020\220\276\240h\207>H\231#\276\366\221d\2766\336\250\275hXf=\200l\275\275n\232\266\273\032\310\306;9\270F=\370\003\357=f\334\232=1\336(=\351\344\014>;\034\026\276\261%\267=\275e_>E?\220=p]\030\276\304cZ>\377\325\377=\255\364\277=\354J\226\274,\317\245\275\0178\223\275#\031\004\276q1 >rI%\276\312\223\320\275\340\360*=%b\223=z3\t\276\01490\276\037\211>>\241\014\274\275Z\322>\275O\277\250=<&X\276\237\327;\275Ud\271\275,\315#>\350o\335=VIp\276z\014O\275\271\251\216>\210\035\r\276\371\235\362\275~Q\t>\314\n`\275N\256 \275EH\271=1=\242=Q\2222\275h\025\013\275}z@=\031\307K>\013\326m>\335\234\025=\006\212\320\275B\033\223=\226\227\000\276\351\333\037\276:]:\2764\263j\274M\276\270\275\261\350\317\275-G\254<+\346\302=\366\n\222\275\030_I\275\272\233\243<\230.\243\275\367-4=\345D_<\214\264\361=\360\2320=\023\273L>\355\332\333\273\017\360\025\276\346.\206>Y~u\2759\032\234\275\331\224\220>PFw=$\023\373=\340\275\207=\212\037\212\276j\353 >\315\020\205\274\375*$=ZE\362;\311\216\312<\000\313\002\276\240Z =+x0>\266N\265\275\271!\252;\237\351\034\275\'\016\347=R\275L\275;\004\313=;\323H\276\317\004\215\276f\010\222\275\245\177M\276\203HO>@\013\253</\311\033\2769\226\002>=^\001=\017\352\234\275\242#\212\275B\330\302\275\"\214\n>p\206j>qD\241\276w\347\254\2754\035#>a8\345<)\344U\275>\320\023\275[f\320\274\013\207\303\275\324|\357\273M\355J\276\013\na<F8\213=\231\365\267\276\277|H;\023\037\253\275yK\265<x \"\275\227\327\025>\225\347\206=\030\213\216=\232\214\221=e\355e=\341\310\334\275=Um\276it\332\275\030\244J;\326\360 >[\322\274<\331#\201>C\261e\276\326\035P\275\337\305~\276G\232\"\273]\212\354=\317\026E>x\212\237\275\265\234\241\275W\355\352=Z)&\275W\217\017=P\242\002\275\332\322\251=d\234\244\275b@\233:\\~\343<\027@8\276\0220\321=\216\t\024\276hz]\276\317\341\345\274\323d\001=\244\240\026\275\001\321S<r\t\304\275\230 \360\275/_\255\2751\001-\276D\036p\275}c\221\276\254(4\275\000\241#>\311z\324\275\265\316\004\275\023\027F\276\234d\014\275J\306\206\272\347\242!\276\325\257\004\275\352\200\332=I\221\260\274]\331@\276\275\360\330\275\334\255E\276\357\0300>\372\246\261>\305Y\251\273BV >\330\005\362\2759\221\263=\213\334\361=\0346\202\274\013.L\275\246\236v\276\273\377<=q\224\'\276KqL=z\2173\274\032\357,\275\025\227\014<6\334\247\274\307\202D>Ky\247\275\341\230\324\275I\213C<#\371\362\275Slc\275\t\323g\275mK\024\276\230\334\217\275\253\034p>l\315 >\310\036|>\212\033E\276f=3=\304\337\317=5Lm>\023$H>\221|:\274K\343\316\274~t\246\275<\251\026\275:]\274\274\357ph\275\027\245U\276%24>\037\262\251=4\363\264\273\225\364\364=\237\251\031=\364\216\235=&\200\004=\260\332\240\274\275<\272=\2477 >\024y(\276z\356\236>\225\300\227\275[\341\300<\272\371o=\037\240\372\275\246\023\272\275\342}\362<\243\233\377=\310\240\337\275:\035*\276WLa=\322\324K=E9\325=\366_\211=<\2759\275a6\t\275\024\007\223=h\321\260<\361\270Q>(\305\323\274\204\270\300\275yh\r\276\232\253\243\274c\265Q\275WT\323;\\v\"\276:k\206\275\326\340|\276\335\376$\276\311n\231=\316\363\030=?\n\213\276\362$\'\276\201\235\014\276i\245\343=<\0252>\200L\t>\205z\000\275\246\376f\276@\337`\273\026\320\256<D\223\361<\271+\256\275\232\257\021>\321\271e\276?\275\'\273\230X+\276<\007[>\336*\022>i\344\005\276\177\305\365\275Z1\271=\230#\027=\377\245,\276\'\336j>\333\366\027>\003,\025\2746\203\035\275=\241\264=E;\201\274\\v\310=\244!\316\275/\276F\276sp\305\272\'\010\224\2751\272\313;\223\273\366=J;\232\275\372\014\021\275\"\307\273\273\210\320\000>v\307x<\027\235u>S\305W\276\362[4>H%\"\275[\016\242=V\370\316\275G8-\276L\235\001\276?]\036>x\310\275\275H\004F=\306\2575\276v\356\203\275\330\023\351<\226\030?=,\327\261\274\034\t\243\273\34395\276\244T\215>\265\255\323<X\023\007>[\001i>1=\304\275\221T\320<\364\330\'>i\271L>#\213\036\276q\356Q>/L\337\275\320/\013>\034\215\327\274\331V\215=, \023=[\256\252>\372M~\275o\031\337=\246\216k<\263\254N>\212\352\255=\354\351\370=\264\2679\276\006L\006=\302f\010\276h\031\241=\2228\343<9\201\235=\2157\213=Uo\036>\226\353\207>\337\235$>\256\264\237\275\310\226\335=\377\300\251<\002\267\226\274B0;==2\006\276\020\302V=\337\343\257\275B\340\205> \r\007<=\366V=\005\240\267=i\2676=\360\270\016>\325\377\010>\020~Q\272\256\266\221>\203\311(\276\372zj=\005\036O>R\243\220>\3439\265\275I~\321=\3747\377=\022\210N\275&Pb=\255\014M>Rn1\276\323\303r\275\020\350\302=jB\346\274\027\034\247=2\351\022\273\361\037:=w52\276\237\271\256\274Jh\340=\327B\177=\032\310\205=yP\331\275H\336\005\276J\314I>))i>\344\311-\276}\002\006\276j\264>\276\207\321\003\275\277\352\027\275FD\021\275\361\257\245=?\304Z\275\260\275\204\276\022\350\n=\372q(\275x\230\025\276\357w\216=\013e\241=\307\020N<\276\213\324;y\324\025>=\367@\276\"\354\007<\277\376\212\273\032\315;\275E\372\007=\302\351\342\275\335k=>\010\246\270\275\367\344\277\274J\027F\276\346J\315<#\251\342\275\306-r=\352\372\002\275\271!m:\026\332.\276~X\027\276m\\\204>\357\257^\276\351\277\215;;\362a\275>4\201\2752\350\036>\222\3669\276\251\264,<\355a\356\275\336`\304\275\'}8\276\311\366\243\276 E\252\274.\347\223<\001\362\221=\252\223\253\274\345:\r\276v\304\206\274C>?>\235\211\213=\276W\005<\233\2220>\263\224\026>r:\276=\304:3>\373\226\200\276\r\001\370\27598\265=\304S\221\275#\377t\276\"\031z<\323\272Z\276\245\\`>=\346\305\275;\271F\274\307\225\033\275\002L\310\275\350\354\321<\337\367\013>\200[\257\274)\201\016=|K\n\2759p\310\275\214l\302\275D$\266\275\322\244\\>\022\361\246\273\312<\300\276\240\276\305\274\234\342a\276\014\253\215\274\037\026\'=\313\372\035\272w\006\004>\272\360\277\275+\321\027>TW\224>\255\216\260=L\005\017>\313E\037=\013\312\234;kx\320<\231\363\257\275\331\2405:\'\005\001\276\313{9>UT\206>5Q\206\275h\225\370;\017\225\253\274\313>\226\275\231\266@\274\305\366\001\276\006\376\260\273\033`a\2757\332\177\274\242\340\255\275J\304v\2760U\210\275\356\374k\276S\333\333\275\227\177\212=\315Y\300>\r\264\210=<[\307<B\'\\\275I.\227\274\245\360#>\307\242\305=S\312\271\274\024y\240\274\2672\037\275\003ah\276Gc-\274\274@x\275x\213\254\2754\205\217=\241a?\275W\326\3519\244\016\230\276/\330t=\232\334\333=)l\t\275v\003\250=\216i\022\273\271M\366\275\274[\201>0R\030\275\215\341+\275\340:\000>\004\2511\276s-\375\275A\313\r=z\215\252\275\325\326\372=\0267F>\370(\252>l;\362:\354v\226\276\356et\274\356w\025\276^\331\260\275# \244\275\350\375\204:\277\303\211\274\304\360\212=\370\332\272=\314\266\216>f\242\t>k:\032\276\003H(>\312\353=>\017\345\344\275x\230\031>\351\220\327=)Q\r\276\350x\302\275\010\350\270=\203\253\327\274@G(\275\237\'\317<\243\213k>\361\003-\276\000\"\177=\215\3021\275\237ja\2755\326\352\274\302\272\344<\026N\366<\ndG=/Y<\276\371\364*\276\302(\326<tb\271\275L[\024\275\253&\003=ug3\275\310`\232=<8v<N\032&>\026&\307\275\352\3524<d\367\362\274%\337C>\205\005\032>\373d\033>$\024\302\275Pi$\275\377\233\004\275C\356@\275\32693<q\237}\2755\014d=+Y\\\276\212\320Z\275\224\242\235\275]\250\t>\206;\360\274\241>\251\276\264o\037\276~\254\367=N\322\372\274\r\237\377; B\371;\320\227\n\276\355\330\253\275\303\'\333\274\344\340<=?N\206>@\034\375=\273\333\215=P\276A\276\323Y\373\275\221\221\351\27313\354=\341\311\265\274\314\2652>\304NT\276b\373\030\274\225W\006\275\3342\310=ZX\232\275)7\215>\370\373\324\275j=\01789`D>\374DT>2\256h\275S~\333\273y\022\224=\376vX\276\216\202Y=\247\340W>\245/\035\275\006\337\320=\205i\217>}\023Z=T\252\213>w\035>\276\230\351E\274H\306k>\303A\266=C\336\212<\260\013\235\272\274\223S\275\345\253a>L:\003>X\233\036=\025\371\213\274\"\253\356=?\305\361\275\313\020\233=r\253\253\2754O\224>\356\226\031>\355\221\037=\332\003\200\275\276\200\312<\334\320$\276A\272S\275U\264\004\276\234\\\202\275\014J\246\275]s\'\275\361(+>.\177\333\275\327\212k<Dp\224=\301\233\254\275\236\347\211>\026\270R>\202\237\225\275A_\224\276.\315?\276\271\002\215\2755\243\325\274\271ZD\276\231\260\246\2751\372\335=>\375\300\275\033\010\010\276D\350\237\274\200\213X=\242\307\253<\221\222\235;K\016\214\275\371\272\222\275\226\306\244\274H`\264\274S\342\302\275(\233(>\311S\215>\251\314\374=\020\345\225=\365a\377=X\251\234=oK\316\275{&\363<\252\324j>\321\342%\276\332\035\032>\004\354\236\275\306\332q>e\354\177\275zf@\276\027\265\341=\031\3148=\214\307\027>\245v\254\275mpH>g6\024\275Gi\221\276^H\255=\010\016\342;\332\250\313=i\006c\276\242|\207\275\312g@;_k\216=\336\254\321\275\261\351\032\276\031\263E=/\220\304\275\270\343\372<!\230\265\275<\261O=\345\253?\274\333\277\330=5.#\276\201\2602=\037\224\256<\222+\262\275:\005^=w\363\207=:\010\026=b\250\204=7\3576>H\364Y\276.\200\232\274\373\261\375\275\336\232Q>6\000\376=\343Y\230=\253rA\275;C\226=\017\\\007\276\265M?>J\274\355\275~\002\301\275\264\254\221>\336\025u>\310,\230\275_\3615\276\356\266\212<nD_\275\307\306\372="
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/Shape_1"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_11/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/strided_slice_11/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_11/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_11"
  op: "StridedSlice"
  input: "net/Shape_1"
  input: "net/strided_slice_11/stack"
  input: "net/strided_slice_11/stack_1"
  input: "net/strided_slice_11/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/Shape_2"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_12/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_12/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_12/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_12"
  op: "StridedSlice"
  input: "net/Shape_2"
  input: "net/strided_slice_12/stack"
  input: "net/strided_slice_12/stack_1"
  input: "net/strided_slice_12/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones/mul"
  op: "Mul"
  input: "net/strided_slice_12"
  input: "net/strided_slice_11"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones/Less/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1000
      }
    }
  }
}
node {
  name: "net/ones/Less"
  op: "Less"
  input: "net/ones/mul"
  input: "net/ones/Less/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones/packed"
  op: "Pack"
  input: "net/strided_slice_12"
  input: "net/strided_slice_11"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "net/ones/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones"
  op: "Fill"
  input: "net/ones/packed"
  input: "net/ones/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
